<?php

// номера команд (индексы массива) выбраны так чтобы было видно
// к какой клавиатуре они - кнопки(значения массива) относятся
// Например команды (они же кнопки) 11(1), 11(2), 11(3) относятся к кнопе 1(1)
// первой - корневой клавиатуры

// TODO разработать древовидную динамическую схему типа родитель-потомок
$commands = [
  // команды текстовые
    1 => '/',
    2 => '/start',
    3 => 'e',
    4 => 'o',
  // команды кнопочные
    5 => 'quit',
    10  => 'НАЗАД',
    11  => 'про обучение', // читай "первая клавиша первого уровня 1(1)"
    111 => 'как проходят уроки', // читай "первая клавиша вышестоящего 1(1(1)) уровня"
    112 => 'стоимость',
    113 => 'преимущества',
    12  => 'задать вопрос',
    121 => 'завершить общение',
    13  => 'категории курсов',
    131 => 'взрослые',
    132 => 'подростки',
    133 => 'дети',
    14  => 'пройти тестирование',
    141 => 'низкий уровень',
    142 => 'высокий уровень',
];

function keyboard($number){
  global $commands;
  switch ($number) {
    case 5:
      return [[['text' => $commands[5] ]]];
    case 10:
      return [

          [
              ['text' => $commands[11] ], // -> 11
              ['text' => $commands[12] ]  // -> 12
          ],
          [
              ['text' => $commands[13] ], // -> 13
              ['text' => $commands[14] ]  // -> 14
          ]
      ];
    case 11:
      return [
          [
              ['text' => $commands[10]],  // -> 10
              ['text' => $commands[111]]
          ],
          [
              ['text' => $commands[112]],
              ['text' => $commands[113]]
          ]
      ];
    case 12:
      # /tobeadmin - стать админом - пароль
      # /tobeexpert - стать экспертом - пароль
      return [
          [
              ['text' => $commands[121]] // -> 10
          ]
      ];
    case 13:
      return [
          [
              ['text' => $commands[10]],  // -> 10
              ['text' => $commands[131]]
          ],
          [
              ['text' => $commands[132]],
              ['text' => $commands[133]]
          ]
      ];
    case 14:
      return [
          [
              ['text' => $commands[10]]   // -> 10
          ],
          [
              ['text' => $commands[141]],
              ['text' => $commands[141]]
          ]
      ];
  }
}
