<?php

$bot_name = BOT_NAME;
$bullet = '&#x2022';

$snippets = [
    'greeting' => "
Здравствуйте! Я бот <b>$bot_name</b>.
Выберите пункт который вас интересует.",

    'про обучение' => "
<b>Foxford Education Platform</b> – онлайн школа английского языка.\n
Мы подберем для Вас необходимый курс английского языка, соответствующий Вашему уровню и занятости.\n
<b>С нами Вы сможете:</b>
$bullet изучать английский язык с разной степенью интенсивности и углубленности
$bullet овладеть навыками английского языка для Вашей сферы профессиональной деятельности
$bullet осуществить мечту путешествовать или общаться с иностранцами без границ
$bullet подготовиться к интервью или собеседованию
$bullet подготовиться к успешной сдаче международных экзаменов, ЗНО и ДПА
И все это Вы сможете делать, не выходя из дома!
    ",

    'преимущества' => "
<b>5 причин, почему Вам подходит онлайн обучение</b>\n
$bullet У Вас плотный график, и Вам не хочется тратить время на дорогу на занятия.\n
$bullet Ваше расписание требует гибкости от преподавателя.\n
$bullet Вы не хотите прерывать обучение во время отпуска, командировки или плохой погоды.\n
$bullet Вы не хотите привязываться к району города.\n
$bullet Вам комфортнее обучаться в своей обстановке.\n",

    'как проходят уроки' => "
$bullet Занятия проходят в группах до 6 человек 2 раза в неделю на нашем сайте, в виртуальной классной комнате, где преподаватель и студенты взаимодействуют друг с другом при помощи веб камеры и гарнитуры.\n
$bullet Для эффективного обучения используются высокотехнологичные средства онлайн обучения: мультимедийная презентация материала, электронный учебник и полезные онлайн ресурсы. Это экономит Ваше время на выполнение домашних заданий и делает их более увлекательными и результативными.\n
$bullet После каждого урока студенту доступна видеозапись урока и интерактивный конспект.\n",

    'стоимость' =>"
Стоимость обучения зависит от формата обучения:
$bullet обучение в группе
$bullet индивидуальные занятия
$bullet подготовка к экзаменам
Более подробную информация можно получить связавшись с экспертом, нажав кнопку в главном меню <b>задать вопрос</b>",

    'взрослые' => "
Общий и разговорный курсы английского. Уровни: <b>pre-A1 - С1</b>.
Срок обучения на каждом уровне: от 3 до 6 месяцев.",

    'подростки' => "
$bullet Общий курс, уровни <b>А1 - С1</b>. Соответствуют рекомендациям МОН для специализированных школ. 
$bullet Летний разговорный интенсив.",

    'дети' => "
Общий курс, уровни <b>pre-A1 - A2</b>. Соответствуют рекомендациям МОН для начальной и средней школ.",

    'обучение преподавателей' => "
$bullet Language for teaching В1-С1
$bullet Prep courses for ТКТ and CELTA
$bullet Webinars and workshops",

    'подготовка экзаменам' => "
Подготовка к Кембриджским экзаменам:
$bullet Для детей (Cambridge YLE)
$bullet Для подростков (Key fs, Preliminary fs, First fs)
$bullet Для взрослых (Key, Preliminary, First, Advanced)\n
Регистрация на экзамен в экзаменационном центре.",


];